# Да се напише асемблерска програма за изразот:
	#i=0
	#while(i<10){
	#A[i]=A[i+2]+100
	#i+=1}
# под претпоставка дека променливата i е сместена во регистарот $s3,а
# почетната адреса на полето A е сместена во регистарот $s6

.data
A: .word 1,2,3,4,5,6,7,8,9,10,11,12,13,14,15

.text
la $s6,A 
add $s3,$zero,$zero #i=0

while:
slti $t0,$s3,10
beq $t0,10,endWhile
	sll $t1,$s3,2 # 4*i
	add $t2,$s6,$t1 # &A + 4*i
	lw $t3,8($t2) # &A+4*i+8	
	addi $t3,$t3,100
	sw $t3,0($t2) 
	
	addi $s3,$s3,1
	j while
	
endWhile: